In [106]:
import pandas as pd
import os

In [107]:
#Create the path 
full_student_data = os.path.join('C:/Users/Mary/Resources/new_full_student_data.csv')

In [108]:
#Import the data
student_df = pd.read_csv(full_student_data)

In [109]:
#Verify that the data was properly imported
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324
...,...,...,...,...,...,...,...,...
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19510,63239258,David Herman,9th,Woods High School,52.1,80.4,Public,912243
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

In [110]:
#Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [111]:
#Drop rows with null values and verify removal
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [112]:
#Check for duplicate rows
student_df.duplicated().sum()

1836

In [113]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [114]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [115]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [116]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [117]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [118]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [119]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [120]:
# Display the mean math score using the mean function
student_df.mean()

C:\Users\Mary\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [121]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [122]:
#Use loc to display the grade column.
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [214]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [2, 3, 4]]

   grade           school_name  reading_score
0      9  Sullivan High School           59.0
1      9     Dixon High School           94.7
2      9    Wagner High School           89.0

In [125]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_nine_df = student_df.loc[student_df["grade"] == 9]
grade_nine_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [126]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score`
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [235]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
student_df.loc[student_df["school_name"] == "Dixon High School", ["grade", "reading_score"]]

       grade  reading_score
1          9           94.7
32        12           90.3
45        10           71.1
58         9           83.5
60        10           59.5
...      ...            ...
19401      9           62.1
19435      9           61.0
19445     10           43.9
19466     12           95.2
19477      9           69.8

[1583 rows x 2 columns]

In [208]:
# Find the mean reading score for all students in grades 11 and 12 combined.
student_df.loc[student_df["grade"] >= 11 , "reading_score"].mean()

74.90038089192188

In [164]:
# Use groupby and mean to find the average reading and math scores for each school type.
avg_student_scores_by_grade = student_df.groupby(by='school_type').mean()
avg_student_scores_by_grade.loc[:, ["math_score", "reading_score"]]

             math_score  reading_score
school_type
Charter       66.761883      72.450603
Public        62.951576      72.281219

In [178]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
students_by_school = student_df.groupby(['school_name']).count()
students_by_school.loc[:, ["student_id"]].sort_values("student_id", ascending=False)

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [ ]:
#Summarizing Findings
##Student Data for each school can be easily evaluated using these simple codes.
#Some examples are finding the Average scores for each course in each school, or the minimum scores and the count.
#This can help schools understand where their students rank against others so they can make corrections to improve teaching.